CREATE DATABASE IF NOT EXISTS s4nd_dwh;

drop table IF EXISTS s4nd_dwh.zs4nd_d47;

CREATE TABLE IF NOT EXISTS s4nd_dwh.zs4nd_d47
(
    `first_column` Int32 DEFAULT 0,
    `id` String COMMENT '2.0 Уникальный идентификатор версии записи',
    `project` String COMMENT '2.1 Уникальный код проекта.',
    `executor` String COMMENT '2.2 Исполнитель проекта (ФИО или подразделение).',
    `project_vid` String COMMENT '2.3 Вид проекта (например, капитальный ремонт, строительство).',
    `full_format` String COMMENT '2.4 Полный формат проекта (описание типа объекта).',
    `format_tp` String COMMENT '2.5 Формат ТП (технологического передела).',
    `cnt_gbl` String COMMENT '2.6 Количество ГБЛ (генерирующих безопасных объектов).',
    `vid_rassm` String COMMENT '2.7 Вид рассмотрения (плановый, внеплановый).',
    `prior_rassm` String COMMENT '2.8 Приоритетность рассмотрения (высокий, средний, низкий).',
    `fm_area` String COMMENT '2.9 ПФМ основной ТП (обозначение площадки).',
    `funds_ctr` String COMMENT '2.9 ПФМ основной ТП (аналогично fm_area).',
    `funds_ctr_union` String COMMENT '2.10 ПФМ объединяемых ТП (перечисление через запятую).',
    `funds_ctr_shtxt` String COMMENT '2.11 Краткое наименование ТП.',
    `subject` String COMMENT '2.12 Субъект Российской Федерации.',
    `region` String COMMENT '2.13 Регион (уточнённое название).',
    `address` String COMMENT '2.14 Адрес реализации проекта.',
    `s_tp` String COMMENT '2.15 Площадь ТП, кв.м.',
    `chisl_max` Int32 COMMENT '2.16 Максимальная численность, ШЕ (штатных единиц).',
    `date_realize` Date COMMENT '2.17 Планируемая дата реализации проекта.',
    `remark` String COMMENT '2.18 Дополнительный комментарий.',
    `status` String COMMENT '2.19 Текущий статус рассмотрения проекта.',
    `fdate_post` Date COMMENT '2.20 Планируемая дата реализации проекта.',
    `fdate_zav` Date COMMENT '2.21 Фактическая дата завершения рассмотрения проекта УБ ФД.',
    `date_zav_rassm` Date COMMENT '2.22 Плановая дата завершения рассмотрения (устанавливается рук-вом УБ ФД).',
    `date_norm_zav` Date COMMENT '2.23 Нормативная дата завершения рассмотрения.',
    `is_finans` String COMMENT '2.24 Требуется ли финансирование проекта? (да/нет).',
    `status_finans` String COMMENT '2.25 Статус выделения финансирования?',
    `date_finans` Date COMMENT '2.26 Фактическая дата выделения финансирования.',
    `fin_1_year` Int32 COMMENT '2.27 Первый год, на который было выделено финансирования (20NN).',
    `budget` Decimal(17, 2) COMMENT '2.28 Бюджет проекта всего.',
    `fin_plan_ahr_0` Decimal(17, 2) COMMENT '2.29 Плановый объем финансирования АХР - 20NN.',
    `fin_plan_kv_0` Decimal(17, 2) COMMENT '2.30 Плановый объем финансирования КВ - 20NN.',
    `otlag_usl` String COMMENT '2.30.1 Тип отлагательного условия.',
    `date_vipoln_otl_usl` Date COMMENT '2.30.2 Дата выполнения отлагательного условия.',
    `fin_plan_ahr_1` Decimal(17, 2) COMMENT '2.31 Плановый объем финансирования АХР - 20NN+1.',
    `fin_plan_kv_1` Decimal(17, 2) COMMENT '2.32 Плановый объем финансирования КВ - 20NN+1.',
    `fin_plan_ahr_2` Decimal(17, 2) COMMENT '2.33 Плановый объем финансирования АХР - 20NN+2.',
    `fin_plan_kv_2` Decimal(17, 2) COMMENT '2.34 Плановый объем финансирования КВ - 20NN+2.',
    `project_plan` String COMMENT '2.1 Уникальный код проекта - плановый',
    `doc_link` String COMMENT 'Ссылка на документацию по проекту',
    `date_from` Date DEFAULT today() COMMENT 'Дата начала действия версии. Обязательное поле.',
    `date_to` Nullable(Date) COMMENT 'Дата окончания действия версии. NULL означает "действует бессрочно".',
    `is_deleted` UInt8 DEFAULT 0 COMMENT 'Флаг логического удаления. 1 — версия исключена из активного учёта, но сохранена в истории.'
)
ENGINE = ReplacingMergeTree()
ORDER BY (project, id, date_from)
PARTITION BY toYYYYMM(date_from)
COMMENT '{"app": "asapBI",
\r\n "descr": "ПРиОС - факт",
\r\n "folder": "tables/prios"\r\n}';

INSERT INTO s4nd_dwh.zs4nd_d47 (first_column,id,project,executor,project_vid,full_format,format_tp,cnt_gbl,vid_rassm,prior_rassm,fm_area,funds_ctr,funds_ctr_union,funds_ctr_shtxt,subject,region,address,s_tp,chisl_max,date_realize,remark,status,fdate_post,fdate_zav,date_zav_rassm,date_norm_zav,is_finans,status_finans,date_finans,fin_1_year,budget,fin_plan_ahr_0,fin_plan_kv_0,otlag_usl,date_vipoln_otl_usl,fin_plan_ahr_1,fin_plan_kv_1,fin_plan_ahr_2,fin_plan_kv_2,project_plan,doc_link,date_from,date_to,is_deleted) VALUES
	 (0,'0017','TYPE4-00007-2025-PLN','Иванов И.И.','Реконструкция','','','','','','','','','','','','','',0,'1970-01-01','','','1970-01-01','1970-01-01','1970-01-01','1970-01-01','','','1970-01-01',0,0.00,0.00,0.00,'','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-11-03',NULL,0),
	 (0,'0018','TYPE3-00004-2025-FCT','Иванов И.И.','','','','','','','','','','','','','','',0,'1970-01-01','','','1970-01-01','1970-01-01','1970-01-01','1970-01-01','','','1970-01-01',0,0.00,0.00,0.00,'','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-11-04',NULL,0),
	 (0,'0001','PRJ001','Смахтин П.','Текущий ремонт (>3 млн руб.)','Мультифункциональный (типовой)','Мультифункциональный (типовой)','1','Комиссия','','','','','','','','','',0,'2025-09-24','','Реализация отклонена','2025-09-01','2025-09-01','1970-01-01','2025-09-12','Да','Финансирование отозвано','2025-09-01',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-01','2025-09-05',0),
	 (0,'0004','ОР24033','Алексеев Е.','Переезд ТП','Мультифункциональный (типовой)','Мультифункциональный (типовой)','1','Первоначальное финансирование','','','','','','','','','',0,'2025-09-24','','Завершено','2025-09-01','2025-09-01','1970-01-01','2025-09-11','Да','Финансирование выделено','2025-09-01',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-24',NULL,0),
	 (0,'0016','PRJ003','Осипенко С.','Изменение условий аренды','Мультифункциональный (нетиповой)','Мультифункциональный (нетиповой)','1','Комиссия','','','','','','','','','',0,'2025-09-24','','Завершено','2025-09-12','2025-09-12','1970-01-01','2025-09-13','Нет','Финансирование не требуется','1970-01-01',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-24',NULL,0),
	 (0,'0003','ОР24032','Алексеев Е.','Переезд ТП','Мультифункциональный (типовой)','Мультифункциональный (типовой)','1','Первоначальное финансирование','','','','','','','','','',0,'2025-09-24','','Завершено','2025-09-01','2025-09-01','1970-01-01','2025-09-11','Да','Финансирование выделено','2025-09-01',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-01','2025-09-05',0),
	 (0,'0002','PRJ001','Смахтин П.','Текущий ремонт (>3 млн руб.)','Мультифункциональный (типовой)','Мультифункциональный (типовой)','1','Комиссия','','','','','','','','','',0,'2025-09-24','','Завершено','2025-09-03','2025-09-05','1970-01-01','2025-09-11','Да','Финансирование выделено','2025-09-06',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-06',NULL,0),
	 (0,'0005','ОР24032','Алексеев Е.','Переезд ТП','Мультифункциональный (типовой)','Мультифункциональный (типовой)','1','Комиссия','','','','','','','','','',0,'2025-09-24','','Завершено','2025-09-03','2025-09-05','1970-01-01','2025-09-11','Да','Финансирование выделено','2025-09-06',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-06','2025-09-07',0),
	 (0,'0006','ОР24032','Алексеев Е.','Дополнительное финансирование','Мультифункциональный (типовой)','Мультифункциональный (типовой)','1','Упрощенный порядок','','','','','','','','','',0,'2025-09-26','','Завершено','2025-09-05','2025-09-05','1970-01-01','2025-09-11','Да','Финансирование выделено','2025-09-08',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-08',NULL,0),
	 (0,'0010','PRJ002','Осипенко С.','Открытие ТП','Удаленная точка обслуживания','Удаленная точка обслуживания','1','Комиссия','','','','','','','','','',0,'2025-12-15','','Завершено','2025-09-24','2025-09-25','1970-01-01','2025-09-12','Да','Финансирование выделено','2025-09-25',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-24',NULL,0);
INSERT INTO s4nd_dwh.zs4nd_d47 (first_column,id,project,executor,project_vid,full_format,format_tp,cnt_gbl,vid_rassm,prior_rassm,fm_area,funds_ctr,funds_ctr_union,funds_ctr_shtxt,subject,region,address,s_tp,chisl_max,date_realize,remark,status,fdate_post,fdate_zav,date_zav_rassm,date_norm_zav,is_finans,status_finans,date_finans,fin_1_year,budget,fin_plan_ahr_0,fin_plan_kv_0,otlag_usl,date_vipoln_otl_usl,fin_plan_ahr_1,fin_plan_kv_1,fin_plan_ahr_2,fin_plan_kv_2,project_plan,doc_link,date_from,date_to,is_deleted) VALUES
	 (0,'0013','ОР24111','Любавина М.','Переезд ТП','Мультифункциональный (типовой)','Мультифункциональный (типовой)','1','Комиссия','','','','','','','','','',0,'2025-12-15','','Внутреннее согласование','2025-09-01','2025-09-05','1970-01-01','2025-09-12','Да','Финансирование не выделено','1970-01-01',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-24',NULL,0),
	 (0,'0015','ОР24011','Смахтин П.','Реконструкция ТП','Логистический центр','Логистический центр','1','Комиссия','','','','','','','','','',0,'2025-12-15','','Отправлен на доработку','2025-09-12','2025-09-12','1970-01-01','2025-09-13','Да','Финансирование не выделено','1970-01-01',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-24',NULL,0),
	 (0,'0008','ОР24028','Крючков А.','Открытие ТП','Логистический центр','Логистический центр','1','Комиссия','','','','','','','','','',0,'2026-09-15','','Завершено','2025-09-01','2025-09-15','1970-01-01','2025-09-11','Да','Ожидает выполнения отлагательных условий','1970-01-01',0,0.00,0.00,0.00,'Да','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-24',NULL,0),
	 (0,'0007','MV24162','Крючков А.','Открытие ТП','Легкий офис','Легкий офис','1','Комиссия','','','','','','','','','',0,'2026-09-26','','Завершено','2025-09-12','2025-09-12','1970-01-01','2025-09-11','Да','Ожидает решения КРиОРС','1970-01-01',0,0.00,0.00,0.00,'Да','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-24',NULL,0),
	 (0,'0014','ОР24077','Осипенко С.','Переезд/объединение ТП','Мультифункциональный (нетиповой)','Мультифункциональный (нетиповой)','>1','Комиссия','','','','','','','','','',0,'2026-12-15','','Отзыв инициатора','2025-09-03','2025-09-05','1970-01-01','2025-09-13','Да','Финансирование не выделено','1970-01-01',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-24',NULL,0),
	 (0,'0009','RE24030','Любавина М.','Реконструкция/объединение ТП','Региональный/Бизнес группа','Региональный/Бизнес группа','>1','Комиссия','','','','','','','','','',0,'2026-12-15','','Завершено','2025-08-31','2025-10-01','1970-01-01','2025-09-11','Да','Ожидает выполнения отлагательных условий','1970-01-01',0,0.00,0.00,0.00,'Да','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-24',NULL,0),
	 (0,'0011','ОР24039','Крючков А.','Открытие ТП','Легкий офис','Легкий офис','1','Упрощенный порядок','','','','','','','','','',0,'2026-12-15','','Отправлен на доработку','2025-09-01','2025-09-01','1970-01-01','2025-09-12','Да','Финансирование не требуется','1970-01-01',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-01','2025-09-02',0),
	 (0,'0012','ОР24039','Крючков А.','Открытие ТП','Легкий офис','Легкий офис','1','Упрощенный порядок','','','','','','','','','',0,'2026-12-15','','В работе','2025-09-03','2025-09-05','1970-01-01','2025-09-12','Да','Финансирование не выделено','1970-01-01',0,0.00,0.00,0.00,'Нет','1970-01-01',0.00,0.00,0.00,0.00,'','','2025-09-03',NULL,0);
